BenchBnB/app/models/user.rb

    def reset_session_token!
        self.session_token = self.class.generate_session_token
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "tZQ3tRehTO8oLWHJ4Kt89g"], ["updated_at", "2018-12-10 18:38:20.477395"], ["id", 3]]